project-overview.org
#+title: Project Overview
#+author: Tomas Zwolinski
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Översikt

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.1d40lxinstsw][Webbaserad]] lösning för backend med koppling mot databas för att administrera
- cyklar
- laddstationer
- parkeringszoner
- tillåtna zoner att cykla i
- utlåning/återlämning
- hämtning av cykel

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.gj0i27b1vsnw][REST API]] med möjlighet att koppla in anpassade applikationer.
- Väldokumenterat REST API
- Hantera flera olika versioner, tex genom att använda v1/ som en del i URI:n.
- Hantera autentisering

*** Backenden kan utvecklas i godtyckligt relevant programmeringsspråk
- Python, PHP, JS
- Hantera relevant data.

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.h9x6l2mn1h7][Admin Webbgränssnitt]] där man kan administrera
- Cyklar
- Stationer
- Kunder

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.l3doj0ee6ekb][Kundens Webbgränssnitt]] så att den kan logga in och se
- Konto
- Historik

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.9lb976xg99gm][Kundens App]] så att den kan logga in och se
- låna/lämna tillbaka cykeln
- status på senaste resan
- historik över gjorda resor.

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.yro5c9zb5bii][Intelligensen]] i cykeln, program som styr och övervakar cykeln
- på, av
- hastighet, begränsa hastighet
- position
- behöver service/laddning

* Övrigt

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.fzd271z9cau1][Simulera drift]] i systemet
- starta via docker-compose
- simulera n*1000 cyklar och kunder.

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.tsz0p919gz5x][kodbas]]
- ett eller flera git repon
- enkelt att sätta igång systemet
- använda docker-compose
- varje repo dokumenteras i sin egna README.md

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.oxraxdmxs9qc][Test och Verifikation]]
- automatiserade tester
- CI/CD flöde (github actions)
- kodkvalitet (scrutinizer)
- verktyg för att validera kodstandard mm skall vara del av tester

** [[https://docs.google.com/document/d/1zWksQNmkXJgM7Q66k3-mgcxrexO6eF9xqd0Z632BwlU/edit#heading=h.1gcjrcfzfp07][Driftsättning]]
- docker-compose
- starta hela systemet med ett kommando

*** optionellt
- driftsätt externt
